#include <stdio.h>
#include <string.h>
#include <windows.h>
#include <stdlib.h>


void printCenter(const char *mess) {
    int i = 0, count = 0;
    while (mess[i] != '\0')
    {
        if ((mess[i++] & 0xC0) != 0X80) count++;
    }
    int space = (120 - count) / 2 + 1;
    printf ("%*s%s", space, "", mess);
}



int main() {
    SetConsoleOutputCP(65001);
    SetConsoleCP(65001);
    printCenter("╔══════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗\n");
    printCenter("╠══════════════════════════════════════════════════════════════════════════════════════════════════════════════════╣\n");
    printCenter("║                                                                                                                  ║\n");
    printCenter("║                                                                                                                  ║\n");
    printCenter("║                  ████████╗██████╗ ██╗   ██╗██╗   ██╗███████╗███╗   ██╗   █████╗   █████╗                         ║\n");
    printCenter("║                  ╚══██╔══╝██╔══██╗██║   ██║╚██╗ ██╔╝██╔════╝████╗  ██║  ██╔══██╗ ██╔══██╗                        ║\n");
    printCenter("║                     ██║   ██████╔╝██║   ██║ ╚████╔╝ █████╗  ██╔██╗ ██║  ╚█████╔╝ ╚█████╔╝                        ║\n");
    printCenter("║                     ██║   ██╔══██╗██║   ██║  ╚██╔╝  ██╔══╝  ██║╚██╗██║  ██╔══██╗ ██╔══██╗                        ║\n");
    printCenter("║                     ██║   ██║  ██║╚██████╔╝   ██║   ███████╗██║ ╚████║  ╚█████╔╝ ╚█████╔╝                        ║\n");
    printCenter("║                     ╚═╝   ╚═╝  ╚═╝ ╚═════╝    ╚═╝   ╚══════╝╚═╝  ╚═══╝   ╚════╝   ╚════╝                         ║\n");
    printCenter("║                                                                                                                  ║\n");
    printCenter("║                                                                                                                  ║\n");
    printCenter("╠══════════════════════════════════════════════════════════════════════════════════════════════════════════════════╣\n");
    printCenter("║                                                                                                                  ║\n");
    printCenter("╠══════════════════════════════════════════════════════════════════════════════════════════════════════════════════╣\n");
    printCenter("║                                                                                                                  ║\n");
    printCenter("║                                                                                                                  ║\n");
    printCenter("║                                  ╔════════════════════════════════════════╗                                      ║\n");
    printCenter("║                                  ║ HỆ THỐNG QUẢN LÝ CHO THUÊ TRUYỆN TRANH ║                                      ║\n");
    printCenter("║                                  ╠════════════════════════════════════════╣                                      ║\n");
    printCenter("║                                  ║ 1. Dữ liệu truyện                      ║                                      ║\n");
    printCenter("║                                  ║ 2. Dữ liệu người thuê truyện           ║                                      ║\n");
    printCenter("║                                  ║ 3. Thống kê                            ║                                      ║\n");
    printCenter("║                                  ║ 4. Exit                                ║                                      ║\n");
    printCenter("║                                  ╚════════════════════════════════════════╝                                      ║\n");
    printCenter("║                                                                                                                  ║\n");
    printCenter("║                                                                                                                  ║\n");
    printCenter("║                                                                                                                  ║\n");
    printCenter("╚══════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝\n");

    printf ("Choose: ");
    
    switch(getchar())
    {
        case '1':   
            system("start muc_luc.exe");
            return 0;
        case '2':
        case '3':
        case '4':
        default: break;
    }

    return 0;
}